# Relatório de Análises I

## Importando a base de dados

In [1]:
import pandas as pd

In [2]:
dados = pd.read_csv('aluguel.csv/aluguel.csv' , sep=';')
dados.head(5)

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000.0,NaN,NaN
2,Conjunto Comercial/Sala,Barra da Tijuca,0,4,0,150,5200.0,4020.0,1111.0
3,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0
4,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,NaN

In [3]:
type(dados)

pandas.core.frame.DataFrame

## Informações gerais sobre a base de dados

In [4]:
tipos_de_dados = pd.DataFrame(dados.dtypes , columns = ['Tipos de Dados'])

In [5]:
tipos_de_dados.columns.name = 'Variáveis'
tipos_de_dados

Variáveis  Tipos de Dados
Tipo               object
Bairro             object
Quartos             int64
Vagas               int64
Suites              int64
Area                int64
Valor             float64
Condominio        float64
IPTU              float64

In [6]:
dados.shape

(32960, 9)

# Parte 2

## Remover repetições dos tipos de imóveis

In [7]:
tipo_de_imovel = dados['Tipo']

In [8]:
type(tipo_de_imovel)

pandas.core.series.Series

In [9]:
tipo_de_imovel.drop_duplicates(inplace = False) #True to apply the changes

0                          Quitinete
1                               Casa
2            Conjunto Comercial/Sala
3                        Apartamento
7                 Casa de Condomínio
16                    Prédio Inteiro
17                              Flat
29                        Loja/Salão
80           Galpão/Depósito/Armazém
83                    Casa Comercial
117                     Casa de Vila
159                   Terreno Padrão
207                      Box/Garagem
347                             Loft
589      Loja Shopping/ Ct Comercial
2157                         Chácara
3354           Loteamento/Condomínio
4379                           Sítio
4721                   Pousada/Chalé
6983                          Studio
9687                           Hotel
23614                      Indústria
Name: Tipo, dtype: object

In [10]:
tipo_de_imovel

0                      Quitinete
1                           Casa
2        Conjunto Comercial/Sala
3                    Apartamento
4                    Apartamento
                  ...
32955                  Quitinete
32956                Apartamento
32957                Apartamento
32958                Apartamento
32959    Conjunto Comercial/Sala
Name: Tipo, Length: 32960, dtype: object

## Organizando a visualização

In [11]:
tipo_de_imovel = pd.DataFrame(tipo_de_imovel)
tipo_de_imovel.index = range(tipo_de_imovel.shape[0])
tipo_de_imovel.head()

                      Tipo
0                Quitinete
1                     Casa
2  Conjunto Comercial/Sala
3              Apartamento
4              Apartamento

In [12]:
tipo_de_imovel.columns.name = 'Id'
tipo_de_imovel.head()

Id                     Tipo
0                 Quitinete
1                      Casa
2   Conjunto Comercial/Sala
3               Apartamento
4               Apartamento

# Parte 3

## Remover imóveis que não sejam 'residenciais'

In [13]:
list(tipo_de_imovel)

['Tipo']

In [14]:
residencial = ['Quitinete',
 'Casa',
 'Apartamento',
 'Casa de Condomínio',
 'Casa de Vila']
residencial

['Quitinete', 'Casa', 'Apartamento', 'Casa de Condomínio', 'Casa de Vila']

In [15]:
selecao = dados['Tipo'].isin(residencial)
selecao.index = range(selecao.shape[0])
selecao

0         True
1         True
2        False
3         True
4         True
         ...
32955     True
32956     True
32957     True
32958     True
32959    False
Name: Tipo, Length: 32960, dtype: bool

In [16]:
dados_residencial = dados[  dados['Tipo'].isin(residencial)  ]
dados_residencial.index = range(dados_residencial.shape[0])
dados_residencial

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000.0,NaN,NaN
2,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0
3,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,NaN
4,Apartamento,Vista Alegre,3,1,0,70,1200.0,NaN,NaN
...,...,...,...,...,...,...,...,...,...
22575,Apartamento,Méier,2,0,0,70,900.0,490.0,48.0
22576,Quitinete,Centro,0,0,0,27,800.0,350.0,25.0
22577,Apartamento,Jacarepaguá,3,1,2,78,1800.0,800.0,40.0
22578,Apartamento,São Francisco Xavier,2,1,0,48,1400.0,509.0,37.0
22579,Apartamento,Leblon,2,0,0,70,3000.0,760.0,NaN

## Exportando a base de dados

In [17]:
dados_residencial.to_csv('aluguel.csv/aluguel_residencial.csv')

In [18]:
dados_residencial_2 = pd.read_csv('aluguel.csv/aluguel_residencial.csv')
dados_residencial_2.head() # Acontece dele exportar os índices como colunas de dados. É possível resolver isso

,Unnamed: 0,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0
1,1,Casa,Jardim Botânico,2,0,1,100,7000.0,NaN,NaN
2,2,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0
3,3,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,NaN
4,4,Apartamento,Vista Alegre,3,1,0,70,1200.0,NaN,NaN

In [19]:
dados_residencial.to_csv('aluguel.csv/aluguel_residencial.csv', sep = ';' , index = False)
dados_residencial_2 = pd.read_csv('aluguel.csv/aluguel_residencial.csv' , sep = ';')
dados_residencial_2.head()

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000.0,NaN,NaN
2,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0
3,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,NaN
4,Apartamento,Vista Alegre,3,1,0,70,1200.0,NaN,NaN

# Parte 5

## Filtragens sofisticadas e contagem da frequência

In [20]:
# Somente tipo apartamento
selecao = dados['Tipo'] == 'Apartamento'
n_apartamentos = dados[selecao].shape[0]
n_apartamentos

19532

In [21]:
# 'Casa', 'Casa de Condomínio' ou 'Casa de Vila'
selecao = (dados['Tipo'] == 'Casa') | (dados['Tipo'] == 'Casa de Condomínio') | (dados['Tipo'] == 'Casa de Vila')
n_casas = dados[selecao].shape[0]
n_casas

2212

In [22]:
# Área 60 <= A <= 100
selecao = (dados['Area'] >= 60) & (dados['Area'] <= 100)
n_area = dados[selecao].shape[0]
n_area

10187

In [23]:
# Pelo menos 4 quartos e aluguel menor que 2000 reais
selecao = (dados['Quartos'] >= 4) & (dados['Valor'] < 2000)
n_comb = dados[selecao].shape[0]
n_comb

43

In [24]:
# Podemos usar também da seguinte forma:
# Index com loc e iloc, com números ou usando 'df.Column'